/*******************************************************************************
    fifo.h
    JOB60842サンプルプログラム
    ML674000 FIFOバッファ制御ルーチンヘッダー

    Copyright(C) 2003, Oki Electric Industry Co.,Ltd.
      All rights reserved.

    更新履歴
    Mar.31,2003 rev1.00:新規作成
*******************************************************************************/
#ifndef FIFO_H
#define FIFO_H

/*----------------------------------------------------------------------------
  グローバル変数
----------------------------------------------------------------------------*/
typedef struct _buf{
	char	*data;
	int		size;
	int		start;
	int		next;
}FIFO;

/*----------------------------------------------------------------------------
  プロトタイプ宣言
----------------------------------------------------------------------------*/
int fifo_init(FIFO *, char *, int);
int fifo_push(FIFO *, char);
int fifo_pop(FIFO *);
int fifo_status(FIFO *);

#endif /* FIFO_H */
