/*******************************************************************************
    board.h
    JOB60842サンプルプログラム 
    ボードの定義
    Copyright(C) 2003, Oki Electric Industry Co.,Ltd.
      All rights reserved.

    更新履歴
    Mar.31,2003 rev1.00:新規作成
*******************************************************************************/
#ifndef _BOARD_H_
#define	_BOARD_H_



/******************************************************************************/
#endif /*_BOARD_H_*/
/* End of file */
